In [1]:
import pandas as pd
from sqlalchemy import create_engine
import sqlite3

In [2]:
#/* Q10: Produce a list of facilities with a total revenue less(more) than 1000.
## The output of facility name and total revenue, sorted by revenue. Remember
### that there's a different cost for guests and members! */

connection = sqlite3.connect("sqlite_db_pythonsqlite.db") 
crsr = connection.cursor()
crsr.execute("SELECT name, SUM(membercost+guestcost) AS revenue FROM Bookings AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY name HAVING revenue>1000 ORDER BY revenue")
df = pd.DataFrame(crsr.fetchall())
df

                 0        1
0     Table Tennis   2015.0
1    Snooker Table   2220.0
2       Pool Table   4180.0
3  Badminton Court   5936.5
4     Squash Court   9240.0
5   Massage Room 2   9978.9
6   Tennis Court 2  11670.0
7   Tennis Court 1  12240.0
8   Massage Room 1  56547.1

In [3]:
#Question 11  Produce a report of members and who recommended them in alphabetic surname,firstname order */
connection = sqlite3.connect("sqlite_db_pythonsqlite.db") 
crsr = connection.cursor() 
crsr.execute("SELECT surname, firstname, recommendedby FROM Members")  
df = pd.DataFrame(crsr.fetchall())
df.head(5)

          0       1  2
0     GUEST   GUEST
1     Smith  Darren
2     Smith   Tracy
3    Rownam     Tim
4  Joplette  Janice  1

In [4]:
#Question Q12: Find the facilities with their usage by member, but not guests *//
connection = sqlite3.connect("sqlite_db_pythonsqlite.db") 
crsr = connection.cursor() 
crsr.execute("SELECT f.name, m.firstname,m.surname FROM Facilities AS f LEFT JOIN Members as m")  
df = pd.DataFrame(crsr.fetchall())
df.head(5)

                0       1         2
0  Tennis Court 1   GUEST     GUEST
1  Tennis Court 1  Darren     Smith
2  Tennis Court 1   Tracy     Smith
3  Tennis Court 1     Tim    Rownam
4  Tennis Court 1  Janice  Joplette

In [5]:
#Q13 Find the facilities usage by month, but not guests
connection = sqlite3.connect("sqlite_db_pythonsqlite.db") 
crsr = connection.cursor() 
crsr.execute("SELECT b.starttime, f.name FROM Bookings AS b LEFT JOIN Facilities as f ON b.facid=f.facid GROUP BY b.starttime")  
df = pd.DataFrame(crsr.fetchall())
df.head(5)

                     0               1
0  2012-07-03 08:00:00  Massage Room 1
1  2012-07-03 10:00:00      Pool Table
2  2012-07-03 11:00:00    Table Tennis
3  2012-07-03 15:00:00      Pool Table
4  2012-07-03 18:00:00    Squash Court